

// Переменные и типы данных. Классная работа

// Задание №1
// 	Создайте программу на JavaScript, которая будет запрашивать у
// пользователя два целых числа по очереди, а затем отобразит на экране их
// сумму, разность, произведение и результат деления.
// Пример ввода:
// 	•	10
// 	•	5
// Пример вывода:
// 	•	10 + 5 = 15,
// 	•	10 - 5 = 5,
// 	•	10 * 5 = 50,
// 	•	10 / 5 = 2

    //  let num1 = +prompt("Enter first number:")
    //  let num2 = +prompt("Enter second number:")
    // //  console.log(num1,num2)

    //  alert(`${num1+num2},${num1-num2},${num1*num2},${num1/num2}`);

    //  let add = num1 + num2;
    //  let sub = num1 - num2;
    //  let mul = num1 * num2;
    //  let div = num1 / num2;
    // alert(add);
    // alert(sub);
    // alert(mul);
    // alert(div);

// Задание №2
// Создайте переменные a6, a7, a8, a9, a10.
// Поместите в них результат выражений:
// 	•	5 % 3,
// 	•	3 % 5,
// 	•	5 + '3',
// 	•	'5' - 3,
// 	•	75 + 'кг'


//    let a6 = 5 % 3;
//    let a7 = 3 % 5;
//    let a8 = 5 +'3';
//    let a9 = '5' - 3;
//    let a10 = 75 + 'кг'
//    console.log(a6,a7,a8,a9,a10);
// Задание №3
// Создайте несколько переменных с типом данных str, так, чтобы одна переменная
// содержала одно слово, затем объедините их в одно предложение, так, чтобы слова были
// записаны через пробел.
// Пример ввода:
//     'Hello'
//     'World'
// Пример вывода:
//     'Hello World'

//   let str = "Hello";
//   let str1 = "Makers";
//   console.log(str + " " + str1)